; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 444506 2 1 2 8 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared1 - mode
	thermograph0 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star7 - direction
	GroundStation6 - direction
	GroundStation5 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(pointing satellite0 Phenomenon9)
	(have_image Planet8 thermograph0)
	(have_image Phenomenon9 infrared1)
	(have_image Phenomenon10 infrared1)
	(have_image Phenomenon11 infrared1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (turn_to satellite1 planet8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet8)
   goals met: 0 of 5
4. (turn_to satellite0 phenomenon9 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 5
5. (turn_to satellite1 groundstation5 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation5)
   goals met: 1 of 5
6. (turn_to satellite0 groundstation6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 5
7. (calibrate satellite1 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 5
8. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 0 of 5
9. (turn_to satellite1 planet8 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet8)
   goals met: 0 of 5
10. (turn_to satellite0 phenomenon9 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 5
11. (take_image satellite1 planet8 instrument1 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 2 of 5
12. (take_image satellite0 phenomenon9 instrument0 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 3 of 5
13. (turn_to satellite0 phenomenon11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 5
14. (turn_to satellite1 phenomenon10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 5
15. (take_image satellite0 phenomenon11 instrument0 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 3 of 5
16. (take_image satellite1 phenomenon10 instrument1 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 4 of 5
17. (turn_to satellite0 phenomenon9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 5
